Revit 2026 API

# KeyBasedTreeEntry Methods

---

The KeyBasedTreeEntry type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetChildrenKeys | Gets a collection containing the keys of all children entry objects from this entry. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

KeyBasedTreeEntry Class

Autodesk.Revit.DB Namespace